In [1]:
import pandas as pd
import numpy as np

In [2]:
print("pandas ver = {}".format(pd.__version__))
print("Numpy ver = ",np.__version__)

pandas ver = 1.2.4
Numpy ver =  1.20.1

In [3]:
file="c:/jaewook/movies_title.csv"
movie=pd.read_csv(file)
movie

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [81]:
sm=movie
sm

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [9]:
sm["title"]

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [10]:
sm.title

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [83]:
sm["title"].value_counts()

Hamlet                  19
Carmen                  14
Macbeth                 14
The Three Musketeers    12
Maya                    11
                        ..
Tiger in the Smoke       1
Capas                    1
Cang hai yi zhu          1
Andiamo a quel paese     1
Sau Saal Beet Gaye       1
Name: title, Length: 197575, dtype: int64

In [12]:
sm.head(3)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969

In [13]:
sm.shape[0]

215981

In [14]:
sm.shape[1]

2

In [15]:
sm.columns

Index(['title', 'year'], dtype='object')

In [18]:
list(sm.columns)[:2]

['title', 'year']

In [20]:
for i in sm.columns:
    print(i)

title
year

In [21]:
sm.columns.values[0:5]

array(['title', 'year'], dtype=object)

In [23]:
sm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [24]:
sm.tail(3)

               title  year
215978         E yue  2005
215979  Lakota Girls  2015
215980  The Sting II  1983

In [25]:
sm.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [26]:
sm.isnull().sum()

title    0
year     0
dtype: int64

In [27]:
sm.isnull().sum().sum()

0

In [28]:
sm.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [84]:

smcnt=sm["title"].value_counts()
smcnt#햄릿 19개
tr=sm["tlte"]

Hamlet                  19
Carmen                  14
Macbeth                 14
The Three Musketeers    12
Maya                    11
                        ..
Tiger in the Smoke       1
Capas                    1
Cang hai yi zhu          1
Andiamo a quel paese     1
Sau Saal Beet Gaye       1
Name: title, Length: 197575, dtype: int64

In [56]:
df=pd.DataFrame(smcnt,columns=["title"])
df #197575개

                      title
Hamlet                   19
Carmen                   14
Macbeth                  14
The Three Musketeers     12
Maya                     11
...                     ...
Tiger in the Smoke        1
Capas                     1
Cang hai yi zhu           1
Andiamo a quel paese      1
Sau Saal Beet Gaye        1

[197575 rows x 1 columns]

In [65]:
df.count()

title    197575
dtype: int64

In [92]:
y=sm["year"]
ys=y.sort_values()
ys #1894년,1897년

165182    1894
85708     1897
115903    1899
198354    1899
12582     1900
          ...
26537     2022
185368    2022
40476     2022
199790    2024
44198     2024
Name: year, Length: 215981, dtype: int64

In [103]:
sm

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [105]:
sm.loc[(sm["title"]=="Hamlet")].count()

title    19
year     19
dtype: int64

In [107]:
a=[]
for i in sm["year"]:
    if 1950<= i <=1959:
        i+=1
print("1950년에서 1959년 사이 만들어진 영화 갯수: {}개".format(i))

1950년에서 1959년 사이 만들어진 영화 갯수: 1983개

In [110]:
b=sm.loc[(sm["title"]=="Treasure Island")].value_counts().count()
b

8